#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_iam_policy.aws_managed_s3_full_access: Reading...
data.aws_region.current: Reading...
data.aws_iam_policy.aws_ec2_full_access: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.irsa-ebs-csi.data.aws_caller_identity.current: Reading...
module.eks.data.aws_partition.current: Reading...
data.aws_caller_identity.current: Reading...
data.aws_iam_policy.aws_managed_ecr_power_user_policy: Reading...
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/bodhi-int-eks/cluster]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0a9d8458221f98f37]
data.aws_region.current: Read complete after 0s [id=ap-southeast-1]
data.aws_iam_policy.ebs_csi_policy: Reading...
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
aws_s3_bucket.bodhi_file_bucket: Refreshing state... [id=bodhi-file-bucket]
module.irsa-ebs-csi.data.aws_caller_identity.current: Read complete after 0s [id=476114114107]
module.eks.data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 1s [id=476114114107]
aws_s3_bucket.bodhi_image_bucket: Refreshing state... [id=bodhi-image-bucket]
data.aws_iam_policy.aws_managed_ecr_power_user_policy: Read complete after 1s [id=arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryPowerUser]
data.aws_iam_policy.aws_managed_ecr_full_access: Reading...
data.aws_iam_policy.aws_ec2_full_access: Read complete after 1s [id=arn:aws:iam::aws:policy/AmazonEC2FullAccess]
data.aws_iam_policy.aws_managed_read_only_access: Reading...
data.aws_iam_policy.aws_managed_s3_full_access: Read complete after 1s [id=arn:aws:iam::aws:policy/AmazonS3FullAccess]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.irsa-ebs-csi.data.aws_partition.current: Reading...
module.irsa-ebs-csi.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=bodhi-int-eks-cluster-20241014091753202000000001]
data.aws_iam_policy.ebs_csi_policy: Read complete after 1s [id=arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy]
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 1s [id=476114114107]
data.aws_iam_policy.aws_managed_ecr_full_access: Read complete after 0s [id=arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryFullAccess]
module.eks.data.aws_caller_identity.current: Read complete after 1s [id=476114114107]
module.eks.data.aws_iam_session_context.current: Reading...
module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:sts::476114114107:assumed-role/github-oidc-role/terraform-infra-provision-session]
data.aws_iam_policy.aws_managed_read_only_access: Read complete after 0s [id=arn:aws:iam::aws:policy/ReadOnlyAccess]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=bodhi-int-eks-cluster-20241014091753202000000001-20241014091753524700000002]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=bodhi-int-eks-cluster-20241014091753202000000001-20241014091753590700000003]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=1287776765]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=f2ff4364-802e-4cfb-b72e-c6df357506fd]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/bodhi-int-eks]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::476114114107:policy/bodhi-int-eks-cluster-ClusterEncryption20241014091821157400000008]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=bodhi-int-eks-cluster-20241014091753202000000001-20241014091821382100000009]
module.vpc.aws_vpc_ipv4_cidr_block_association.this[0]: Refreshing state... [id=vpc-cidr-assoc-006a1e9311cf11f88]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-07a141daeb5cbc060]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0559079df1e6144e8]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-00cd924de82b36051]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-04958eba1b3abe078]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-00858e7f3e8e60f5c]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0747f29838df91d97]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0669be7fff14179ad]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-02e96125f1d14517e]
module.eks.module.eks_managed_node_group["k8s-core"].data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["int"].data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["k8s-core"].data.aws_caller_identity.current: Read complete after 0s [id=476114114107]
module.eks.module.eks_managed_node_group["k8s-core"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["k8s-core"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["int"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["int"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["k8s-core"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["k8s-core"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.eks_managed_node_group["int"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["int"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0ea25e2b01d757771]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-3959025701]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-4102136992]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-2418055019]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-1989882638]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-1245629660]
module.eks.module.eks_managed_node_group["int"].data.aws_caller_identity.current: Read complete after 1s [id=476114114107]
module.eks.aws_security_group_rule.node["node_exporter_ingress_rule"]: Refreshing state... [id=sgrule-2719681735]
module.eks.aws_security_group_rule.node["prometheus_service_ingress_rule"]: Refreshing state... [id=sgrule-2624851430]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-3244037212]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-1291461012]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-1694742451]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-2684604780]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-2205985610]
module.eks.aws_security_group_rule.node["olm_package_server_ingress_rule"]: Refreshing state... [id=sgrule-782237463]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-2114199985]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0747f29838df91d971080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "aws-ebs-csi-driver"
      + id                 = (known after apply)
      + kubernetes_version = "1.29"
      + version            = (known after apply)
    }

  # module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.aws_eks_access_entry.this["cluster_creator"] will be created
  + resource "aws_eks_access_entry" "this" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "bodhi-int-eks"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::476114114107:role/github-oidc-role"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"] will be created
  + resource "aws_eks_access_policy_association" "this" {
      + associated_at = (known after apply)
      + cluster_name  = "bodhi-int-eks"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::476114114107:role/github-oidc-role"

      + access_scope {
          + type = "cluster"
        }
    }

  # module.eks.aws_eks_addon.this["aws-ebs-csi-driver"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "aws-ebs-csi-driver"
      + addon_version               = "v1.33.0-eksbuild.1"
      + arn                         = (known after apply)
      + cluster_name                = "bodhi-int-eks"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + service_account_role_arn    = (known after apply)
      + tags_all                    = (known after apply)

      + timeouts {}
    }

  # module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + enabled_cluster_log_types     = [
          + "api",
          + "audit",
          + "authenticator",
        ]
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "bodhi-int-eks"
      + platform_version              = (known after apply)
      + role_arn                      = "arn:aws:iam::476114114107:role/bodhi-int-eks-cluster-20241014091753202000000001"
      + status                        = (known after apply)
      + tags                          = {
          + "terraform-aws-modules" = "eks"
        }
      + tags_all                      = {
          + "terraform-aws-modules" = "eks"
        }
      + version                       = "1.29"

      + access_config {
          + authentication_mode                         = "API_AND_CONFIG_MAP"
          + bootstrap_cluster_creator_admin_permissions = false
        }

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = "arn:aws:kms:ap-southeast-1:476114114107:key/f2ff4364-802e-4cfb-b72e-c6df357506fd"
            }
        }

      + kubernetes_network_config {
          + ip_family         = "ipv4"
          + service_ipv4_cidr = (known after apply)
          + service_ipv6_cidr = (known after apply)
        }

      + timeouts {}

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = false
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = [
              + "sg-04958eba1b3abe078",
            ]
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
  + resource "aws_iam_openid_connect_provider" "oidc_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Name" = "bodhi-int-eks-eks-irsa"
        }
      + tags_all        = {
          + "Name" = "bodhi-int-eks-eks-irsa"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks.time_sleep.this[0] will be created
  + resource "time_sleep" "this" {
      + create_duration = "30s"
      + id              = (known after apply)
      + triggers        = {
          + "cluster_certificate_authority_data" = (known after apply)
          + "cluster_endpoint"                   = (known after apply)
          + "cluster_name"                       = "bodhi-int-eks"
          + "cluster_service_cidr"               = (known after apply)
          + "cluster_version"                    = "1.29"
        }
    }

  # module.irsa-ebs-csi.data.aws_iam_policy_document.assume_role_with_oidc[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role_with_oidc" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)
    }

  # module.irsa-ebs-csi.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "AmazonEKSTFEBSCSIRole-ap-east-1-bodhi-int-eks"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.irsa-ebs-csi.aws_iam_role_policy_attachment.custom[0] will be created
  + resource "aws_iam_role_policy_attachment" "custom" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy"
      + role       = "AmazonEKSTFEBSCSIRole-ap-east-1-bodhi-int-eks"
    }

  # module.vpc.aws_eip.nat[1] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"              = "terraform-managed-eks-vpc-ap-east-1b"
          + "environment"       = "prod"
          + "terraform-managed" = "true"
        }
      + tags_all             = {
          + "Name"              = "terraform-managed-eks-vpc-ap-east-1b"
          + "environment"       = "prod"
          + "terraform-managed" = "true"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.aws_eip.nat[2] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"              = "terraform-managed-eks-vpc-ap-east-1c"
          + "environment"       = "prod"
          + "terraform-managed" = "true"
        }
      + tags_all             = {
          + "Name"              = "terraform-managed-eks-vpc-ap-east-1c"
          + "environment"       = "prod"
          + "terraform-managed" = "true"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = "eipalloc-0ea25e2b01d757771"
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name"              = "terraform-managed-eks-vpc-ap-east-1a"
          + "environment"       = "prod"
          + "terraform-managed" = "true"
        }
      + tags_all                           = {
          + "Name"              = "terraform-managed-eks-vpc-ap-east-1a"
          + "environment"       = "prod"
          + "terraform-managed" = "true"
        }
    }

  # module.vpc.aws_nat_gateway.this[1] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name"              = "terraform-managed-eks-vpc-ap-east-1b"
          + "environment"       = "prod"
          + "terraform-managed" = "true"
        }
      + tags_all                           = {
          + "Name"              = "terraform-managed-eks-vpc-ap-east-1b"
          + "environment"       = "prod"
          + "terraform-managed" = "true"
        }
    }

  # module.vpc.aws_nat_gateway.this[2] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name"              = "terraform-managed-eks-vpc-ap-east-1c"
          + "environment"       = "prod"
          + "terraform-managed" = "true"
        }
      + tags_all                           = {
          + "Name"              = "terraform-managed-eks-vpc-ap-east-1c"
          + "environment"       = "prod"
          + "terraform-managed" = "true"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-02e96125f1d14517e"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[1] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[2] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"              = "terraform-managed-eks-vpc-private-ap-east-1b"
          + "environment"       = "prod"
          + "terraform-managed" = "true"
        }
      + tags_all         = {
          + "Name"              = "terraform-managed-eks-vpc-private-ap-east-1b"
          + "environment"       = "prod"
          + "terraform-managed" = "true"
        }
      + vpc_id           = "vpc-0a9d8458221f98f37"
    }

  # module.vpc.aws_route_table.private[2] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"              = "terraform-managed-eks-vpc-private-ap-east-1c"
          + "environment"       = "prod"
          + "terraform-managed" = "true"
        }
      + tags_all         = {
          + "Name"              = "terraform-managed-eks-vpc-private-ap-east-1c"
          + "environment"       = "prod"
          + "terraform-managed" = "true"
        }
      + vpc_id           = "vpc-0a9d8458221f98f37"
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = "rtb-02e96125f1d14517e"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[3] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = "rtb-02e96125f1d14517e"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[4] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[5] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = "rtb-0747f29838df91d97"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = "rtb-0747f29838df91d97"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = "rtb-0747f29838df91d97"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[3] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = "rtb-0747f29838df91d97"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[4] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = "rtb-0747f29838df91d97"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[5] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = "rtb-0747f29838df91d97"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "terraform-managed-eks-vpc-private-ap-east-1a"
          + "environment"                     = "prod"
          + "kubernetes.io/role/internal-elb" = "1"
          + "terraform-managed"               = "true"
        }
      + tags_all                                       = {
          + "Name"                            = "terraform-managed-eks-vpc-private-ap-east-1a"
          + "environment"                     = "prod"
          + "kubernetes.io/role/internal-elb" = "1"
          + "terraform-managed"               = "true"
        }
      + vpc_id                                         = "vpc-0a9d8458221f98f37"
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "terraform-managed-eks-vpc-private-ap-east-1b"
          + "environment"                     = "prod"
          + "kubernetes.io/role/internal-elb" = "1"
          + "terraform-managed"               = "true"
        }
      + tags_all                                       = {
          + "Name"                            = "terraform-managed-eks-vpc-private-ap-east-1b"
          + "environment"                     = "prod"
          + "kubernetes.io/role/internal-elb" = "1"
          + "terraform-managed"               = "true"
        }
      + vpc_id                                         = "vpc-0a9d8458221f98f37"
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "terraform-managed-eks-vpc-private-ap-east-1c"
          + "environment"                     = "prod"
          + "kubernetes.io/role/internal-elb" = "1"
          + "terraform-managed"               = "true"
        }
      + tags_all                                       = {
          + "Name"                            = "terraform-managed-eks-vpc-private-ap-east-1c"
          + "environment"                     = "prod"
          + "kubernetes.io/role/internal-elb" = "1"
          + "terraform-managed"               = "true"
        }
      + vpc_id                                         = "vpc-0a9d8458221f98f37"
    }

  # module.vpc.aws_subnet.private[3] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.32.0.0/18"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "terraform-managed-eks-vpc-private-ap-east-1a"
          + "environment"                     = "prod"
          + "kubernetes.io/role/internal-elb" = "1"
          + "terraform-managed"               = "true"
        }
      + tags_all                                       = {
          + "Name"                            = "terraform-managed-eks-vpc-private-ap-east-1a"
          + "environment"                     = "prod"
          + "kubernetes.io/role/internal-elb" = "1"
          + "terraform-managed"               = "true"
        }
      + vpc_id                                         = "vpc-0a9d8458221f98f37"
    }

  # module.vpc.aws_subnet.private[4] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.32.64.0/18"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "terraform-managed-eks-vpc-private-ap-east-1b"
          + "environment"                     = "prod"
          + "kubernetes.io/role/internal-elb" = "1"
          + "terraform-managed"               = "true"
        }
      + tags_all                                       = {
          + "Name"                            = "terraform-managed-eks-vpc-private-ap-east-1b"
          + "environment"                     = "prod"
          + "kubernetes.io/role/internal-elb" = "1"
          + "terraform-managed"               = "true"
        }
      + vpc_id                                         = "vpc-0a9d8458221f98f37"
    }

  # module.vpc.aws_subnet.private[5] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.32.128.0/18"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "terraform-managed-eks-vpc-private-ap-east-1c"
          + "environment"                     = "prod"
          + "kubernetes.io/role/internal-elb" = "1"
          + "terraform-managed"               = "true"
        }
      + tags_all                                       = {
          + "Name"                            = "terraform-managed-eks-vpc-private-ap-east-1c"
          + "environment"                     = "prod"
          + "kubernetes.io/role/internal-elb" = "1"
          + "terraform-managed"               = "true"
        }
      + vpc_id                                         = "vpc-0a9d8458221f98f37"
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.10.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                   = "terraform-managed-eks-vpc-public-ap-east-1a"
          + "environment"            = "prod"
          + "kubernetes.io/role/elb" = "1"
          + "terraform-managed"      = "true"
        }
      + tags_all                                       = {
          + "Name"                   = "terraform-managed-eks-vpc-public-ap-east-1a"
          + "environment"            = "prod"
          + "kubernetes.io/role/elb" = "1"
          + "terraform-managed"      = "true"
        }
      + vpc_id                                         = "vpc-0a9d8458221f98f37"
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.20.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                   = "terraform-managed-eks-vpc-public-ap-east-1b"
          + "environment"            = "prod"
          + "kubernetes.io/role/elb" = "1"
          + "terraform-managed"      = "true"
        }
      + tags_all                                       = {
          + "Name"                   = "terraform-managed-eks-vpc-public-ap-east-1b"
          + "environment"            = "prod"
          + "kubernetes.io/role/elb" = "1"
          + "terraform-managed"      = "true"
        }
      + vpc_id                                         = "vpc-0a9d8458221f98f37"
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.30.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                   = "terraform-managed-eks-vpc-public-ap-east-1c"
          + "environment"            = "prod"
          + "kubernetes.io/role/elb" = "1"
          + "terraform-managed"      = "true"
        }
      + tags_all                                       = {
          + "Name"                   = "terraform-managed-eks-vpc-public-ap-east-1c"
          + "environment"            = "prod"
          + "kubernetes.io/role/elb" = "1"
          + "terraform-managed"      = "true"
        }
      + vpc_id                                         = "vpc-0a9d8458221f98f37"
    }

  # module.vpc.aws_subnet.public[3] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.32.192.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                   = "terraform-managed-eks-vpc-public-ap-east-1a"
          + "environment"            = "prod"
          + "kubernetes.io/role/elb" = "1"
          + "terraform-managed"      = "true"
        }
      + tags_all                                       = {
          + "Name"                   = "terraform-managed-eks-vpc-public-ap-east-1a"
          + "environment"            = "prod"
          + "kubernetes.io/role/elb" = "1"
          + "terraform-managed"      = "true"
        }
      + vpc_id                                         = "vpc-0a9d8458221f98f37"
    }

  # module.vpc.aws_subnet.public[4] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.32.193.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                   = "terraform-managed-eks-vpc-public-ap-east-1b"
          + "environment"            = "prod"
          + "kubernetes.io/role/elb" = "1"
          + "terraform-managed"      = "true"
        }
      + tags_all                                       = {
          + "Name"                   = "terraform-managed-eks-vpc-public-ap-east-1b"
          + "environment"            = "prod"
          + "kubernetes.io/role/elb" = "1"
          + "terraform-managed"      = "true"
        }
      + vpc_id                                         = "vpc-0a9d8458221f98f37"
    }

  # module.vpc.aws_subnet.public[5] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.32.194.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                   = "terraform-managed-eks-vpc-public-ap-east-1c"
          + "environment"            = "prod"
          + "kubernetes.io/role/elb" = "1"
          + "terraform-managed"      = "true"
        }
      + tags_all                                       = {
          + "Name"                   = "terraform-managed-eks-vpc-public-ap-east-1c"
          + "environment"            = "prod"
          + "kubernetes.io/role/elb" = "1"
          + "terraform-managed"      = "true"
        }
      + vpc_id                                         = "vpc-0a9d8458221f98f37"
    }

  # module.eks.module.eks_managed_node_group["int"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = "AL2_x86_64"
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "bodhi-int-eks"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.micro",
        ]
      + labels                 = {
          + "nodegroup" = "int"
        }
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "int-"
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "Name"                                    = "int"
          + "k8s.io/cluster-autoscaler/bodhi-int-eks" = "owned"
          + "k8s.io/cluster-autoscaler/enabled"       = "TRUE"
        }
      + tags_all               = {
          + "Name"                                    = "int"
          + "k8s.io/cluster-autoscaler/bodhi-int-eks" = "owned"
          + "k8s.io/cluster-autoscaler/enabled"       = "TRUE"
        }
      + version                = "1.29"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 1
          + max_size     = 2
          + min_size     = 1
        }

      + timeouts {}

      + update_config {
          + max_unavailable_percentage = 33
        }
    }

  # module.eks.module.eks_managed_node_group["int"].aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSNodeAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "EKS managed node group IAM role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "int-eks-node-group-"
      + path                  = "/"
      + tags                  = {
          + "k8s.io/cluster-autoscaler/bodhi-int-eks" = "owned"
          + "k8s.io/cluster-autoscaler/enabled"       = "TRUE"
        }
      + tags_all              = {
          + "k8s.io/cluster-autoscaler/bodhi-int-eks" = "owned"
          + "k8s.io/cluster-autoscaler/enabled"       = "TRUE"
        }
      + unique_id             = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["int"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["int"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["int"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["int"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Custom launch template for int EKS managed node group"
      + id                     = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "int-"
      + tags                   = {
          + "k8s.io/cluster-autoscaler/bodhi-int-eks" = "owned"
          + "k8s.io/cluster-autoscaler/enabled"       = "TRUE"
        }
      + tags_all               = {
          + "k8s.io/cluster-autoscaler/bodhi-int-eks" = "owned"
          + "k8s.io/cluster-autoscaler/enabled"       = "TRUE"
        }
      + update_default_version = true
      + vpc_security_group_ids = [
          + "sg-0559079df1e6144e8",
        ]
        # (2 unchanged attributes hidden)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + monitoring {
          + enabled = true
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name"                                    = "int"
              + "k8s.io/cluster-autoscaler/bodhi-int-eks" = "owned"
              + "k8s.io/cluster-autoscaler/enabled"       = "TRUE"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Name"                                    = "int"
              + "k8s.io/cluster-autoscaler/bodhi-int-eks" = "owned"
              + "k8s.io/cluster-autoscaler/enabled"       = "TRUE"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Name"                                    = "int"
              + "k8s.io/cluster-autoscaler/bodhi-int-eks" = "owned"
              + "k8s.io/cluster-autoscaler/enabled"       = "TRUE"
            }
        }
    }

  # module.eks.module.eks_managed_node_group["k8s-core"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = "AL2_ARM_64"
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "bodhi-int-eks"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.micro",
        ]
      + labels                 = {
          + "nodegroup" = "k8s-core"
        }
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "k8s-core-"
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "Name"                                    = "k8s-core"
          + "k8s.io/cluster-autoscaler/bodhi-int-eks" = "owned"
          + "k8s.io/cluster-autoscaler/enabled"       = "TRUE"
        }
      + tags_all               = {
          + "Name"                                    = "k8s-core"
          + "k8s.io/cluster-autoscaler/bodhi-int-eks" = "owned"
          + "k8s.io/cluster-autoscaler/enabled"       = "TRUE"
        }
      + version                = "1.29"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 1
          + max_size     = 2
          + min_size     = 1
        }

      + timeouts {}

      + update_config {
          + max_unavailable_percentage = 33
        }
    }

  # module.eks.module.eks_managed_node_group["k8s-core"].aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSNodeAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "EKS managed node group IAM role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "k8s-core-eks-node-group-"
      + path                  = "/"
      + tags                  = {
          + "k8s.io/cluster-autoscaler/bodhi-int-eks" = "owned"
          + "k8s.io/cluster-autoscaler/enabled"       = "TRUE"
        }
      + tags_all              = {
          + "k8s.io/cluster-autoscaler/bodhi-int-eks" = "owned"
          + "k8s.io/cluster-autoscaler/enabled"       = "TRUE"
        }
      + unique_id             = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["k8s-core"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["k8s-core"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["k8s-core"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["k8s-core"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Custom launch template for k8s-core EKS managed node group"
      + id                     = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "k8s-core-"
      + tags                   = {
          + "k8s.io/cluster-autoscaler/bodhi-int-eks" = "owned"
          + "k8s.io/cluster-autoscaler/enabled"       = "TRUE"
        }
      + tags_all               = {
          + "k8s.io/cluster-autoscaler/bodhi-int-eks" = "owned"
          + "k8s.io/cluster-autoscaler/enabled"       = "TRUE"
        }
      + update_default_version = true
      + vpc_security_group_ids = [
          + "sg-0559079df1e6144e8",
        ]
        # (2 unchanged attributes hidden)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + monitoring {
          + enabled = true
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name"                                    = "k8s-core"
              + "k8s.io/cluster-autoscaler/bodhi-int-eks" = "owned"
              + "k8s.io/cluster-autoscaler/enabled"       = "TRUE"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Name"                                    = "k8s-core"
              + "k8s.io/cluster-autoscaler/bodhi-int-eks" = "owned"
              + "k8s.io/cluster-autoscaler/enabled"       = "TRUE"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Name"                                    = "k8s-core"
              + "k8s.io/cluster-autoscaler/bodhi-int-eks" = "owned"
              + "k8s.io/cluster-autoscaler/enabled"       = "TRUE"
            }
        }
    }

  # module.eks.module.eks_managed_node_group["int"].module.user_data.null_resource.validate_cluster_service_cidr will be created
  + resource "null_resource" "validate_cluster_service_cidr" {
      + id = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["k8s-core"].module.user_data.null_resource.validate_cluster_service_cidr will be created
  + resource "null_resource" "validate_cluster_service_cidr" {
      + id = (known after apply)
    }

Plan: 56 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.eks.aws_iam_role.this[0],
  on .terraform/modules/eks/main.tf line 387, in resource "aws_iam_role" "this":
 387: resource "aws_iam_role" "this" {

The inline_policy argument is deprecated. Use the aws_iam_role_policy
resource instead. If Terraform should exclusively manage all inline policy
associations (the current behavior of this argument), use the
aws_iam_role_policies_exclusive resource as well.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @DavidGoodman2333, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Infra Plan - AP Southeast 1`*